Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_194-The-Sutra_of_Jayamati-v1.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisatvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus I have heard at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་མང་པོ་དག་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: The Bhagavān was residing at the grove of Anāthapiṇḍada in Jeta Wood in Śrāvastī together with a great assembly of monks and a great multitude of bodhisatvas.

source: །གཟུགས་བཟང་བ་འདོད་པས་བཟོད་པ་བསྒོམ་པར་བྱའོ།
en: who desires beauty should cultivate patience;

source: །ཡེ་ཤེས་འདོད་པས་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ལ་གནས་པར་བྱའོ།
en: who desires knowledge should frequently practice appropriate mindfulness;

source: །གཟུངས་འདོད་པས་མངོན་པའི་ང་རྒྱལ་མེད་པར་བྱའོ།
en: who desires memory should not have excessive pride;

source: །སྤོབས་པ་འདོད་པས་བླ་མ་ལ་གུས་པར་བྱའོ།
en: who desires eloquence should pay respect to the guru;

source: ། ཐར་པ་འདོད་པས་སྡིག་པ་ཐམས་ཅད་སྤང་བར་བྱའོ།
en: who desires liberation should abstain from all evil;

source: །སེམས་ཅན་ཐམས་ཅད་བདེ་བར་བྱ་བར་འདོད་པས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བྱའོ།
en: who desires to make all beings happy should generate the mind for awakening;

source: །སྐད་སྙན་པ་འདོད་པས་བདེན་པར་སྨྲ་བར་བྱའོ།
en: who desires a sweet voice should speak truthfully;

source: །ཡོན་ཏན་འདོད་པས་རབ་ཏུ་དབེན་པ་ལ་དགའ་བར་བྱའོ།
en: who desires virtuous qualities should take joy in solitude;

source: །ཆོས་འདོད་པས་དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པར་བྱའོ།
en: who desires the Dharma should attend to the spiritual friend;

source: །ཞི་གནས་འདོད་པས་འདུ་འཛི་མེད་པ་མང་དུ་བྱའོ།
en: who desires quiescence should frequently practice no contact with others;

source: །ལྷག་མཐོང་འདོད་པས་ཆོས་སྟོང་པར་སོ་སོར་བརྟག་པ་མང་དུ་བྱའོ།
en: who desires insight should frequently examine things as empty;

source: །ཚངས་པའི་འཇིག་རྟེན་འདོད་པས་བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་བསྒོམ་པར་བྱའོ།
en: who desires rebirth in the world of Brahmā should cultivate love, compassion, joy, and equanimity;

source: །ལྷ་དང་མིའི་ལོངས་སྤྱོད་ཕུན་སུམ་ཚོགས་པ་འདོད་པས་དགེ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཏེ་གནས་པར་བྱའོ།
en: who desires the abundant resources of gods and humans should behave in conformity with the path of ten virtuous actions;

source: །ཡོངས་སུ་མྱ་ངན་འདའ་བར་འདོད་པས་སྟོང་པའི་ཆོས་ལ་མངོན་པར་དགའ་བར་བྱའོ།
en: who desires complete nirvāṇa should take joy in empty dharmas;

source: །ཡོན་ཏན་ཐམས་ཅད་ཐོབ་པར་འདོད་པས་དཀོན་མཆོག་གསུམ་ལ་མཆོད་པར་བྱའོ།
en: who desires to obtain all virtuous qualities should worship the Three Jewels.”

source: །།འཕགས་པ་རྒྱལ་བའི་བློ་གྲོས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: This completes the Noble Mahāyāna sūtra, The Inquiry of Jayamati.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྒྱལ་བའི་བློ་གྲོས་ལ་བཀའ་སྩལ་པ།
en: Then, the Bhagavān addressed the bodhisatva Jayamati as follows.

source: རྒྱལ་བའི་བློ་གྲོས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་
en: Jayamati, a faithful man or woman of a good family

source: བསོད་ནམས་འདོད་པས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་བྱའོ།
en: who desires merit should worship the Tathāgata;

source: །ཤེས་རབ་འདོད་པས་ཐོས་པ་ལ་བརྩོན་པར་བྱའོ།
en: who desires discernment should be devoted to learning;

source: །མཐོ་རིས་འདོད་པས་ཚུལ་ཁྲིམས་བསྲུང་བར་བྱའོ།
en: who desires heavenly rebirth should uphold moral conduct;

source: །ལོངས་སྤྱོད་འདོད་པས་གཏོང་བ་སྦེལ་བར་བྱའོ།
en: who desires wealth should increase charity;

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: When the Bhagavān had spoken,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་བའི་བློ་གྲོས་དང་།
en: the bodhisatva mahāsatva Jayamati,

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།།
en: the complete assembly, and the world with its gods, humans, demigods and gandharvas rejoiced and highly praised what had been proclaimed by the Bhagavān.
